type Props = {};

export default function AboutUs({}: Props) {
  return (
    <main>
      <div
        className="relative z-10 flex items-center justify-center bg-page-pattern bg-center bg-cover h-52
            before:content-['']
            before:absolute
            before:inset-0
            before:block
            before:bg-gradient-to-t
            before:from-primary/70
            before:to-gray-700
            before:opacity-75
            before:z-[-5]"
      >
        <h1 className="text-white text-6xl">عن المنصة</h1>
      </div>
      <section className="max-w-4xl mx-auto px-6 md:px-0 py-10">
        <div className="col-xl-7 mx-auto md:mx-5 lg:mx-auto">
          <h2 className="text-primary font-bold text-3xl mb-4">عن المنصة</h2>
          <p>
            هذه منصة خاصة بدروس ومحاضرات الشيخ المقرئ د. صفوت محمود سالم -رحمه
            الله- والذي انتقل إلى جوار ربه في يوم الأحد 17 شعبان 1443 بعد مسيرة
            قرآنية مباركة استمرت على مدى أكثر من 4 عقود قضاها في خدمة القرآن
            الكريم وتعليمه وإقرائه، وقد كتب الله -تعالى- له القبول في الأرض
            وانتفع به أهل القرآن من كل مكان وامتد أثر جهوده في حياته ونسأل الله
            -تعالى- أن يجعلها ذخراً له في الدنيا والآخرة.
          </p>
          <br />
          <p>{`ومن الواجب علينا تجاه شيخنا فقيد أهل القرآن أن نعرف بجهوده وننشر آثاره وعلمه وانطلاقاً من قول النبي -صلى الله عليه وسلم-: {إذا مات الإنسان انقطع عنه عمله إلا من ثلاثة: إلا من صدقة جارية، أو علم ينتفع به، أو ولد صالح يدعو له}، 
          لهذا الهدف، خصصت هذه المنصة لنشر الدروس والمحاضرات التي نشرت في قناته على اليوتيوب وفهرستها وفق المنهج المتعارف عليه عند علماء التجويد والقراءات تيسيراً للوصول لها وللإفادة منها.
          `}</p>
          <br />
          <p>
            ونسأل الله -تعالى- أن يتقبل منا جميعاً ويجعل هذه القناة خالصة لوجهه
            الكريم وأن يغفر لشيخنا ويرحمه ويكرم نزله ويجعله ممن يقال لهم: اقرأ
            وارق ورتل كما كنت ترتل في الدنيا فإن منزلتك عند آخر آية تقرؤها.
          </p>
        </div>
      </section>
    </main>
  );
}
