type Props = {};

export default function Terms({}: Props) {
  return (
    <main>
      <div
        className="relative z-10 flex items-center justify-center bg-page-pattern bg-center bg-cover h-52
            before:content-['']
            before:absolute
            before:inset-0
            before:block
            before:bg-gradient-to-t
            before:from-primary/70
            before:to-gray-700
            before:opacity-75
            before:z-[-5]"
      >
        <h1 className="text-white text-6xl">شرط المنصة</h1>
      </div>

      <section className="max-w-4xl mx-auto py-10">
        <div className="col-xl-7 mx-auto">
          <h2 className="text-primary font-bold text-3xl mb-4">شرط المنصة</h2>
          <p>
            هذه المنصة تم إنشاؤها لتكون صدقة جارية لروح الشيخ صفوت سالم، لحفظ
            تراثه من قراءات و دروس و مصنفات و نشره بين طلاب العلم، و لا يراد بها
            أي ربح كان ماديا أو تسويقيا. لهذا المبتغى نرجوا منكم الإلتزام بشروط
            المنصة التالية:
          </p>
          <br />
          <ul className="list-disc  ms-10 [&>li]:mb-3">
            <li>
              الاحتفاظ بحقوق الملكية الفكرية: يجب الالتزام بالحفاظ على حقوق
              الملكية الفكرية لفضيلة الشيخ صفوت سالم رحمه الله وعدم نسبها لغيره.
            </li>
            <li>
              عدم التعديل: يمنع تعديل أو تغيير المحتوى أو اقتصاصه عن إطاره بأي
              شكل من الأشكال، و المسؤولون عن المنصة لا يتحملون مسؤولية المحتوى
              المجتزء و ماقد يتسبب فيه من لبس أو سوء فهم.
            </li>
            <li>
              الغرض الخيري: تم تطوير هذه المنصة الإلكترونية لتكون صدقة جارية
              للشيخ صفوت سالم رحمه الله، وليس لأي غرض تجاري أو لتحقيق أي نفع
              مادي و أي استخدام لمحتوى المنصة في غير هذا الصدد هو تعدي لشروطها.
            </li>
            <li>
              المساهمة في الخير: يمكن للمستخدمين المساهمة في الخير من خلال
              استخدام المحتوى الذي يتضمن تراث الشيخ صفوت سالم رحمه الله، ودعوة
              الآخرين للاستفادة منه أيضا فالدال على الخير كفاعله و لكل أجر.
            </li>
            <li>
              المسؤولية الاجتماعية: تتحمل المنصة الإلكترونية مسؤولية اجتماعية
              لتعزيز ونشر التراث الثقافي والديني الهام الذي تركه الشيخ صفوت سالم
              رحمه الله، وتحقيق الفائدة العامة للمجتمع.
            </li>
            <li>
              الإشراف والمتابعة: ستقوم المنصة الإلكترونية بمتابعة وإشراف المحتوى
              بشكل دوري، وإزالة أي محتوى يخالف شروط الاستخدام أو القوانين
              السارية.
            </li>
          </ul>
        </div>
      </section>
    </main>
  );
}
